
// Grabs count for failed MFA challenge and display them oer a timeline and fail count.
// Grabs only out of US
///////////////////////////

/// Azure Advance Hunting
///////////////////////////
AADSignEventsBeta
| project
    AadDeviceID,
    AccountDisplayName,
    ErrorCode,
    Timestamp,
    County,
    State,
    DeviceName,
    ReportID
| where Timestap >= ago(1d) //change time in ago to query further back
| where Country != "US"
| where isnotempty(Country)
| where ErrorCode == "50074"
/// data for detection rule
///////////////////////////
| summarze
    FailedMFA=count() by AccountDisplayName, ReportID, Timestamp, Country, DeviceName
/// Generate columnchart for visual
///////////////////////////
//| summarze
//    FailedMFA=count() by AccountDisplayName
//| render
//    columnchart with(kind=unstacked)


/// Azure Sentinel
///////////////////////////
SigninLogs
| where ResultType == "50074"
| project
    UserDisplayName,
    Identity,
    UserPrincipleName,
    ResultDescription,
    AppDescription,
    AppID,
    ResourceDisplayName,
    TimeGenerated,
    Location
| where TimeGenerated between (ago(1d) .. now()) //change time in ago to query further back
| where Location != "US"
| where isnotempty(Location)
| summarze
    FailureCount=count(),
    FailedResources=dcount(ResourceDisplayName),
    ResultDescription=any(ResultDescription), Location=any(Location)
    by Timeline=bin(TimeGenerated, 7d), UserDisplayName
| render
    barchat with(kind=unstacked)
